/**
  ******************************************************************************
  * @file    bell.h
  * @author  xxx
  * @version Vx.x
  * @date    xxxx-xx-xx
  * @brief   xxx.
  ******************************************************************************
  * @attention
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __BELL_H
#define __BELL_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* ¿ØÖÆ·äÃùÆ÷ */
#define BELL_ON   GPIO_SetBits(GPIOB, GPIO_Pin_0)      // ·äÃùÆ÷Ïì
#define BELL_OFF  GPIO_ResetBits(GPIOB, GPIO_Pin_0)    // ·äÃùÆ÷Í£
#define BELL_TOGGLE  GPIOB->ODR ^= GPIO_Pin_0          // ×´Ì¬·´×ª

/* Exported functions ------------------------------------------------------- */
void Bell_Cfg(void);

#endif /* __BELL_H */
/******************************** END OF FILE *********************************/
